public class java {
    public static void main(String[] args) {
        String n=args[0];
        if (n == ""){
            System.out.println("Hello world ");
        }
        else{
            System.out.println("Hello " + n);
        }

    }
}
/*Реализовать программу, получающую на вход в качестве аргумента имя человека и выводящую “Hello ” + имя, в противном случае, если параметр не передавался, “Hello world”.*/
